src/InformationRegisters/КорневыеХарактеристикиМатериала/КорневыеХарактеристикиМатериала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КорневыеХарактеристикиМатериала</name>
  <resources>
    <name>Значение1</name>
    <type>
      <types>Characteristic.ПараметрыМатериалов</types>
    </type>
  </resources>
  <resources>
    <name>Значение2</name>
    <type>
      <types>Characteristic.ПараметрыМатериалов</types>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрМатериала</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыМатериалов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/УсловияПроверки/УсловияПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияПроверки</name>
  <enumValues>
    <name>НеБолее</name>
  </enumValues>
  <enumValues>
    <name>НеМенее</name>
  </enumValues>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>ВДиапазоне</name>
  </enumValues>
  <enumValues>
    <name>НеУжеДиапазона</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/КорневыеХарактеристикиМатериала/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Элементы.Значение1.МногострочныйРежим = Запись.ПараметрМатериала.Многострочный;
Элементы.Значение2.МногострочныйРежим = Запись.ПараметрМатериала.Многострочный;
	Если Запись.ПараметрМатериала.УсловиеПроверки <> Перечисления.УсловияПроверки.ВДиапазоне Тогда
	Элементы.Значение2.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Значение1ПриИзмененииНаСервере()
Элементы.Значение1.МногострочныйРежим = Запись.ПараметрМатериала.Многострочный;
КонецПроцедуры

&НаКлиенте
Процедура Значение1ПриИзменении(Элемент)
Значение1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Значение2ПриИзмененииНаСервере()
Элементы.Значение2.МногострочныйРежим = Запись.ПараметрМатериала.Многострочный;
КонецПроцедуры

&НаКлиенте
Процедура Значение2ПриИзменении(Элемент)
Значение2ПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПараметрТоварнойГруппыПриИзмененииНаСервере()
	Если Запись.ПараметрМатериала.УсловиеПроверки <> Перечисления.УсловияПроверки.ВДиапазоне Тогда
	Элементы.Значение2.Доступность = Ложь;
	Иначе
	Элементы.Значение2.Доступность = Истина;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПараметрТоварнойГруппыПриИзменении(Элемент)
ПараметрТоварнойГруппыПриИзмененииНаСервере();
КонецПроцедуры
